RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_pmu.c
/*!
    \file    gd32h77x_78x_pmu.c
    \brief   PMU driver

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_78x_pmu.h"

/* PMU register bit offset */
#define PAR_TSW_IRCCNT_OFFSET               ((uint32_t)0x00000010U)               /*!< bit offset of TSW_IRCCNT in PMU_PAR */

/*!
    \brief      reset PMU register (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_deinit(void)
{
    /* reset PMU */
    rcu_periph_reset_enable(RCU_PMURST);
    rcu_periph_reset_disable(RCU_PMURST);
}

/*!
    \brief      select low voltage detector threshold (API_ID(0x0002U))
    \param[in]  lvdt_n:
                only one parameter can be selected which is shown as below:
      \arg        PMU_LVDT_0: voltage threshold is 2.1V
      \arg        PMU_LVDT_1: voltage threshold is 2.3V
      \arg        PMU_LVDT_2: voltage threshold is 2.4V
      \arg        PMU_LVDT_3: voltage threshold is 2.6V
      \arg        PMU_LVDT_4: voltage threshold is 2.7V
      \arg        PMU_LVDT_5: voltage threshold is 2.9V
      \arg        PMU_LVDT_6: voltage threshold is 3.0V
      \arg        PMU_LVDT_7: input analog voltage on PB7 (compared with 0.8V)
    \param[out] none
    \retval     none
*/
void pmu_lvd_select(uint32_t lvdt_n)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_LVD(lvdt_n)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0002U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t temp;
        temp = PMU_CTL0;
        /* clear LVDT bits */
        temp &= ~PMU_CTL0_LVDT;
        /* set LVDT bits according to lvdt_n */
        temp |= lvdt_n;
        PMU_CTL0 = temp;
    }
}

/*!
    \brief      enable PMU lvd (API_ID(0x0003U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_lvd_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_LVDEN;
}

/*!
    \brief      disable PMU lvd (API_ID(0x0004U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_lvd_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_LVDEN;
}

/*!
    \brief      select analog voltage detector threshold (API_ID(0x0005U))
    \param[in]  avdt_n:
                only one parameter can be selected which is shown as below:
      \arg        PMU_AVDT_0: voltage threshold is 1.7V
      \arg        PMU_AVDT_1: voltage threshold is 2.1V
      \arg        PMU_AVDT_2: voltage threshold is 2.5V
      \arg        PMU_AVDT_3: voltage threshold is 2.8V
    \param[out] none
    \retval     none
*/
void pmu_avd_select(uint32_t avdt_n)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_AVD(avdt_n)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t temp;
        temp = PMU_CTL0;
        /* clear VAVDVC bits */
        temp &= ~PMU_CTL0_VAVDVC;
        /* set VAVDVC bits according to avdt_n */
        temp |= avdt_n;
        PMU_CTL0 = temp;
    }
}

/*!
    \brief      enable PMU analog voltage detector (API_ID(0x0006U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_avd_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_VAVDEN;
}

/*!
    \brief      disable PMU analog voltage detector (API_ID(0x0007U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_avd_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_VAVDEN;
}

/*!
    \brief      select PMU Vcore over voltage detector threshold (API_ID(0x0008U))
    \param[in]  ovdt_n:
                only one parameter can be selected which is shown as below:
      \arg        PMU_OVDT_0: voltage threshold is 0.9V
      \arg        PMU_OVDT_1: voltage threshold is 1.0V
      \arg        PMU_OVDT_2: voltage threshold is 1.1V
      \arg        PMU_OVDT_3: voltage threshold is 1.2V
    \param[out] none
    \retval     none
*/
void pmu_ovd_select(uint32_t ovdt_n)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_OVD(ovdt_n)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t temp;
        temp = PMU_CTL0;
        /* clear VOVDVC bits */
        temp &= ~PMU_CTL0_VOVDVC;
        /* set VAVDVC bits according to avdt_n */
        temp |= ovdt_n;
        PMU_CTL0 = temp;
    }
}

/*!
    \brief      enable PMU Vcore over voltage detector (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_ovd_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_VOVDEN;
}

/*!
    \brief      disable PMU Vcore over voltage detector (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_ovd_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_VOVDEN;
}

/*!
    \brief      select PMU Vcore under voltage detector threshold (API_ID(0x000BU))
    \param[in]  uvdt_n:
                only one parameter can be selected which is shown as below:
      \arg        PMU_UVDT_0: voltage threshold is 0.8V
      \arg        PMU_UVDT_1: voltage threshold is 0.7V
      \arg        PMU_UVDT_2: voltage threshold is 0.6V
    \param[out] none
    \retval     none
*/
void pmu_uvd_select(uint32_t uvdt_n)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_UVD(uvdt_n)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t temp;
        temp = PMU_CTL0;
        /* clear VAVDVC bits */
        temp &= ~PMU_CTL0_VUVDVC;
        /* set VAVDVC bits according to avdt_n */
        temp |= uvdt_n;
        PMU_CTL0 = temp;
    }
}

/*!
    \brief      enable PMU Vcore under voltage detector (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_uvd_enable(void)
{
    PMU_CTL0 |= PMU_CTL0_VUVDEN;
}

/*!
    \brief      disable PMU Vcore under voltage detector (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_uvd_disable(void)
{
    PMU_CTL0 &= ~PMU_CTL0_VUVDEN;
}

/*!
    \brief      select Deep-sleep mode Vcore core voltage (API_ID(0x000EU))
    \param[in]  sldo:
                only one parameter can be selected which is shown as below:
      \arg        PMU_SLDOVS_1: Deep-sleep mode LDO voltage 0.7V
      \arg        PMU_SLDOVS_2: Deep-sleep mode LDO voltage 0.8V
      \arg        PMU_SLDOVS_3: Deep-sleep mode LDO voltage 0.9V
    \param[out] none
    \retval     none
*/
void pmu_sldo_output_select(uint32_t sldo)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_SLDO(sldo)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t temp;
        temp = PMU_CTL0;
        temp &= ~PMU_CTL0_SLDOVS;
        temp |= sldo;
        PMU_CTL0 = temp;
    }
}

/*!
    \brief      select PMU VBAT battery charging resistor (API_ID(0x000FU))
    \param[in]  resistor:
                only one parameter can be selected which is shown as below:
      \arg        PMU_VCRSEL_5K: 5 kOhms resistor is selected for charing VBAT battery
      \arg        PMU_VCRSEL_1P5K: 1.5 kOhms resistor is selected for charing VBAT battery
    \param[out] none
    \retval     none
*/
void pmu_vbat_charging_select(uint32_t resistor)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_VBAT(resistor)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        PMU_CTL3 &= ~PMU_CTL3_VCRSEL;
        PMU_CTL3 |= resistor;
    }
}

/*!
    \brief      enable VBAT battery charging (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_vbat_charging_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_VCEN;
}

/*!
    \brief      disable VBAT battery charging (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_vbat_charging_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_VCEN;
}

/*!
    \brief      enable VBAT and temperature monitoring (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_vbat_temp_monitor_enable(void)
{
    PMU_CTL1 |= PMU_CTL1_VBTMEN;
}

/*!
    \brief      disable VBAT and temperature monitoring (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_vbat_temp_monitor_disable(void)
{
    PMU_CTL1 &= ~PMU_CTL1_VBTMEN;
}

/*!
    \brief      enable USB regulator (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_usb_regulator_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_USBSEN;
}

/*!
    \brief      disable USB regulator (API_ID(0x0015U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_usb_regulator_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_USBSEN;
}

/*!
    \brief      enable VDD33USB voltage level detector (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_usb_voltage_detector_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_VUSB33DEN;
}

/*!
    \brief      disable VDD33USB voltage level detector (API_ID(0x0017U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_usb_voltage_detector_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_VUSB33DEN;
}

/*!
    \brief      enable pkcau power (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_pkcau_power_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_PKCAUSW;
}

/*!
    \brief      disable pkcau power (API_ID(0x0019U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_pkcau_power_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_PKCAUSW;
}

/*!
    \brief      enable pkcau output isolation (API_ID(0x001AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_pkcau_output_isolation_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_PKCAUHTEN;
}

/*!
    \brief      disable pkcau output isolation (API_ID(0x001BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_pkcau_output_isolation_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_PKCAUHTEN;
}

/*!
    \brief      enable esc power (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_esc_power_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_ESCSW;
}

/*!
    \brief      disable esc power (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_esc_power_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_ESCSW;
}

/*!
    \brief      enable esc output isolation (API_ID(0x001EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_esc_output_isolation_enable(void)
{
    PMU_CTL3 |= PMU_CTL3_ESCHTEN;
}

/*!
    \brief      disable esc output isolation (API_ID(0x001FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_esc_output_isolation_disable(void)
{
    PMU_CTL3 &= ~PMU_CTL3_ESCHTEN;
}

/*!
    \brief      configure power supply (API_ID(0x0020U))
    \param[in]  smpsmode:
                only one parameter can be selected which is shown as below:
      \arg        PMU_DIRECT_SMPS_SUPPLY: SMPS power supplies mode
      \arg        PMU_BYPASS: Bypass mode
    \param[out] none
    \retval     none
*/
void pmu_smps_ldo_supply_config(uint32_t smpsmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_SMPS_LDO_SUPPLY(smpsmode)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t temp;
        temp = PMU_CTL3;
        temp &= ~(PMU_CTL3_DVSEN |  PMU_CTL3_BYPASS);
        temp |= smpsmode;
        PMU_CTL3 = temp;
    }
}

/*!
    \brief      enter sleep mode (API_ID(0x0021U))
    \param[in]  sleepmodecmd:
                only one parameter can be selected which is shown as below:
      \arg        WFI_CMD: use WFI command
      \arg        WFE_CMD: use WFE command
    \param[out] none
    \retval     none
*/
void pmu_to_sleepmode(uint8_t sleepmodecmd)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_SLEEPMODE(sleepmodecmd)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* clear sleepdeep bit of Cortex-M7 system control register */
        SCB->SCR &= ~((uint32_t)SCB_SCR_SLEEPDEEP_Msk);

